In [1]:
import pandas as pd

In [13]:
# 행과 열을 바꾸기(전치행렬)
exam_data = {'이름' : ['서준', '우현', '인아'],
            '수학' : [90, 80, 70],
            '영어' : [98, 89, 95],
            '국어' : [55, 11, 22]}
df = pd.DataFrame(exam_data)
print(df)
df.set_index('이름', inplace=True)

# df.set_index(['수학','영어'], inplace=True)
print(df)

   이름  수학  영어  국어
0  서준  90  98  55
1  우현  80  89  11
2  인아  70  95  22
    수학  영어  국어
이름
서준  90  98  55
우현  80  89  11
인아  70  95  22

In [15]:
df = df.T
df

    수학  영어  국어
이름
서준  90  98  55
우현  80  89  11
인아  70  95  22

In [83]:
# reindex(새로운 인덱스 배열) : 기존의 자료변경 X, 새로운 데이터프레임 반환
dict_data = {'c0' : [1,2,3], 'c1' : [4, 5, 6], 'c2' : [7, 0, 9], 'c3' : [10, 11, 12]}
df = pd.DataFrame(dict_data, index=['r1', 'r2', 'r3'])
df

    c0  c1  c2  c3
r1   1   4   7  10
r2   2   5   0  11
r3   3   6   9  12

In [84]:
# index를 ['r0', 'r1', 'r2', 'r3', 'r4']
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf = df.reindex(new_index) # 존재하지않는 인덱스의 값은 Nan으로 채움
print(ndf)

# ndf1 = df.reindex(new_index, fill_value=0) # 0으로 채움
# ndf1
# # method
# ndf1 = df.reindex(new_index, method='bfill') # 이후 자료 복사
# ndf1

     c0   c1   c2    c3
r0  NaN  NaN  NaN   NaN
r1  1.0  4.0  7.0  10.0
r2  2.0  5.0  0.0  11.0
r3  3.0  6.0  9.0  12.0
r4  NaN  NaN  NaN   NaN

In [27]:
# reset_index() : 인덱스 초기화
print(df)
print(df.reset_index()) # 기존 인덱스 칼럼으로, 인덱스는 초기화
df.reset_index(drop=True)
df

    c0  c1  c2  c3
r1   1   4   7  10
r2   2   5   8  11
r3   3   6   9  12
  index  c0  c1  c2  c3
0    r1   1   4   7  10
1    r2   2   5   8  11
2    r3   3   6   9  12

    c0  c1  c2  c3
r1   1   4   7  10
r2   2   5   8  11
r3   3   6   9  12

In [28]:
# 인덱스를 기준으로 정렬
df.sort_index(ascending=False)

    c0  c1  c2  c3
r3   3   6   9  12
r2   2   5   8  11
r1   1   4   7  10

In [34]:
# 칼럼을 기준으로 정렬
df.loc['r1', 'c0']=2
df.sort_values(by=['c0','c2'], ascending=False)

    c0  c1  c2  c3
r3   3   6   9  12
r1   2   4   7  10
r2   2   5   0  11

In [ ]:
# 시리즈 연산 : 시리즈 +-*/ 사칙연산가능
# 1. 인덱스로 정렬
# 2. 매칭되는 값에 대해 연산, Nan이 있으면 결과는 Nan
# 3. 결과 리턴 -> 인덱스로 정렬된 상태

In [37]:
student = pd.Series({'국어' : 100, '수학' : 90, "영어" : 90})
print(student)

print(student + 200)
print(student - 200)
print(student * 200)
print(student / 200)

국어    100
수학     90
영어     90
dtype: int64
국어    300
수학    290
영어    290
dtype: int64
국어   -100
수학   -110
영어   -110
dtype: int64
국어    20000
수학    18000
영어    18000
dtype: int64
국어    0.50
수학    0.45
영어    0.45
dtype: float64

In [40]:
# 시리즈 연산
import numpy as np
student1 = pd.Series({'국어' : np.nan, '수학' : 90, "영어" : 90})
student2 = pd.Series({'수학' : 90, '국어' : 90, "영어" : 90, '과학' : 100})
print(student1 + student2)

과학      NaN
국어      NaN
수학    180.0
영어    180.0
dtype: float64

In [42]:
# 시리즈 연산 메서드 : 시리즈.add(시리즈1, fill_value=0)
print(student1.add(student2, fill_value=0))
print(student1.sub(student2, fill_value=0))
print(student1.mul(student2, fill_value=0))
print(student1.div(student2, fill_value=0))

과학    100.0
국어     90.0
수학    180.0
영어    180.0
dtype: float64
과학   -100.0
국어    -90.0
수학      0.0
영어      0.0
dtype: float64
과학       0.0
국어       0.0
수학    8100.0
영어    8100.0
dtype: float64
과학    0.0
국어    0.0
수학    1.0
영어    1.0
dtype: float64

In [43]:
# 데이터 프레임 연산 (+ - * /)
# seaborn 에서 dataset 가져오기
import seaborn as sns

In [54]:
titanic = sns.load_dataset('titanic')
titanic.columns
df = titanic.loc[:, ['age', 'fare']]

In [52]:
print(df.head(), '\n', (df+10).head())

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500
     age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [55]:
add_df = df.add(10, fill_value=0)
add_df.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [ ]:
# seaborn 에서 titanic 데이터셋 로드
# class, sex, age, alive 칼럼과 0행부터 100행까지만 자료 추출
# 인덱스를 class로 지정하고 인덱스로 정렬

In [89]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['class', 'sex', 'age', 'alive']].head(101)
df

      class     sex   age alive
0     Third    male  22.0    no
1     First  female  38.0   yes
2     Third  female  26.0   yes
3     First  female  35.0   yes
4     Third    male  35.0    no
..      ...     ...   ...   ...
96    First    male  71.0    no
97    First    male  23.0   yes
98   Second  female  34.0   yes
99   Second    male  34.0    no
100   Third  female  28.0    no

[101 rows x 4 columns]

In [94]:
# new_index = df['class']
# df_class = df.set_index(new_index)
# df_class.sort_index()

new_index = df[]
df_class = df.reindex(new_index)
print(df_class)

       class  sex  age alive
class
Third    NaN  NaN  NaN   NaN
First    NaN  NaN  NaN   NaN
Third    NaN  NaN  NaN   NaN
First    NaN  NaN  NaN   NaN
Third    NaN  NaN  NaN   NaN
...      ...  ...  ...   ...
First    NaN  NaN  NaN   NaN
First    NaN  NaN  NaN   NaN
Second   NaN  NaN  NaN   NaN
Second   NaN  NaN  NaN   NaN
Third    NaN  NaN  NaN   NaN

[101 rows x 4 columns]

In [92]:
new_index

0       Third
1       First
2       Third
3       First
4       Third
        ...
96      First
97      First
98     Second
99     Second
100     Third
Name: class, Length: 101, dtype: category
Categories (3, object): ['First', 'Second', 'Third']